_posts/2014-12-17-Android-Dev-杂记.html
---
layout : post
title : Android Dev 杂记
categories : Android
tags : android color alpha xml
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0f48ec9">1. 如何在 XML 里指定 Alpha 通道</a></li>
<li><a href="#org707d8e4">2. How to force layout to refresh/repaint android?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0f48ec9" class="outline-2">
<h2 id="org0f48ec9"><span class="section-number-2">1</span> 如何在 XML 里指定 Alpha 通道</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://stackoverflow.com/questions/15852122/hex-transparency-in-colors">http://stackoverflow.com/questions/15852122/hex-transparency-in-colors</a>
<a href="http://stackoverflow.com/questions/16611759/how-set-alpha-opacity-value-to-color-on-xml-drawable">http://stackoverflow.com/questions/16611759/how-set-alpha-opacity-value-to-color-on-xml-drawable</a>
</p>
</div>
</div>

<div id="outline-container-org707d8e4" class="outline-2">
<h2 id="org707d8e4"><span class="section-number-2">2</span> How to force layout to refresh/repaint android?</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://stackoverflow.com/questions/18470753/force-layout-to-refresh-repaint-android">http://stackoverflow.com/questions/18470753/force-layout-to-refresh-repaint-android</a>
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #32cd32;">FrameLayout</span> <span style="color: #daa520;">container</span> = (<span style="color: #32cd32;">FrameLayout</span>)findViewById(R.id.main_fragment_container);
<span class="linenr">2: </span>container.invalidate();
<span class="linenr">3: </span>container.requestLayout();
</pre>
</div>
</div>
</div>
